tests/performance/load-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL || 'http://localhost:3000' }}"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 15
      name: "Sustained load"
  defaults:
    headers:
      User-Agent: "Artillery Load Test"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Homepage Load Test"
    weight: 40
    flow:
      - get:
          url: "/"
          capture:
            - header: "content-type"
              as: "contentType"
      - think: 2

  - name: "Static Assets Load Test"
    weight: 30
    flow:
      - get:
          url: "/_next/static/css/app/layout.css"
      - get:
          url: "/_next/static/chunks/webpack.js"
      - think: 1

  - name: "API Health Check"
    weight: 20
    flow:
      - get:
          url: "/api/auth/session"
          expect:
            - statusCode: 200
      - think: 1

  - name: "Authentication Flow"
    weight: 10
    flow:
      - get:
          url: "/api/auth/providers"
          expect:
            - statusCode: 200
      - think: 3