tests/performance/stress-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL || 'http://localhost:3000' }}"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 25
      name: "Ramp up to stress level"
    - duration: 180
      arrivalRate: 50
      name: "Stress test - 50 concurrent users"
    - duration: 120
      arrivalRate: 75
      name: "Peak stress - 75 concurrent users"
    - duration: 60
      arrivalRate: 25
      name: "Cool down"
  defaults:
    headers:
      User-Agent: "Artillery Stress Test"

scenarios:
  - name: "Heavy Homepage Load"
    weight: 50
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/"
      - think: 2

  - name: "API Stress Test"
    weight: 30
    flow:
      - get:
          url: "/api/auth/session"
      - think: 1
      - get:
          url: "/api/auth/providers"
      - think: 1

  - name: "Static Assets Stress"
    weight: 20
    flow:
      - get:
          url: "/_next/static/css/app/layout.css"
      - get:
          url: "/_next/static/chunks/webpack.js"
      - get:
          url: "/favicon.ico"
      - think: 1